import { el, els } from "../helper.js";

// 1. element 유효성 검사 (부모요소 찾고 부모요소 없으면 return;으로 바인딩함수를 종료)
// 2. 변수생성 <= arry 에 대해 map 메소드 실행하여 재가공 (forEach처럼 data.js내의 객체를 순회시킴 + 구조분해할당)
// 3. return으로 새로운 배열 만들어 내보내기 (return `` 템플릿리터럴방식으로 html구조화하여 내보내기)
// 4. 부모요소를 찾아 innerHTML로 2번의 변수(return값)를 넣어준다.

export const alarmBind = (arry) => {
  const element = document.querySelector("#alram");
  if (!element) {
    return;
  }
  const alarmItems = arry.map((item) => {
    // console.log(item);
    // 구조분해할당
    const { date, writer, content } = item;
    return /* html */ `
        <li>
          <div class="alram__date">${item?.date || "-"}</div>
          <div class="alram__writer">${writer}</div>
          <button class="alram__del">
            <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
              <path
                d="M8.22787 6.99535L13.737 1.495C13.9016 1.33033 13.9941 1.107 13.9941 0.874131C13.9941 0.641261 13.9016 0.417929 13.737 0.253265C13.5723 0.0886011 13.349 -0.00390625 13.1161 -0.00390625C12.8832 -0.00390625 12.6599 0.0886011 12.4952 0.253265L6.99489 5.76236L1.49454 0.253265C1.32987 0.0886011 1.10654 -0.00390604 0.87367 -0.00390604C0.6408 -0.00390604 0.417468 0.0886011 0.252804 0.253265C0.0881403 0.417929 -0.00436681 0.641261 -0.00436681 0.874131C-0.00436682 1.107 0.0881403 1.33033 0.252804 1.495L5.7619 6.99535L0.252804 12.4957C0.170843 12.577 0.105788 12.6737 0.0613928 12.7803C0.0169977 12.8868 -0.00585938 13.0011 -0.00585938 13.1166C-0.00585938 13.232 0.0169977 13.3463 0.0613928 13.4529C0.105788 13.5594 0.170843 13.6561 0.252804 13.7374C0.334097 13.8194 0.430813 13.8844 0.537374 13.9288C0.643935 13.9732 0.758231 13.9961 0.87367 13.9961C0.98911 13.9961 1.10341 13.9732 1.20997 13.9288C1.31653 13.8844 1.41324 13.8194 1.49454 13.7374L6.99489 8.22834L12.4952 13.7374C12.5765 13.8194 12.6732 13.8844 12.7798 13.9288C12.8864 13.9732 13.0007 13.9961 13.1161 13.9961C13.2315 13.9961 13.3458 13.9732 13.4524 13.9288C13.559 13.8844 13.6557 13.8194 13.737 13.7374C13.8189 13.6561 13.884 13.5594 13.9284 13.4529C13.9728 13.3463 13.9956 13.232 13.9956 13.1166C13.9956 13.0011 13.9728 12.8868 13.9284 12.7803C13.884 12.6737 13.8189 12.577 13.737 12.4957L8.22787 6.99535Z"
                fill="#999999"
              />
            </svg>
          </button>
          <div class="alram__content">
            ${content}
          </div>
        </li>
    `;
  });

  // console.log(alarmItems);
  el("#alram").innerHTML = alarmItems;

  // 삭제 기능
  const handleDelete = () => {
    // 삭제 기능 작성. e.target
    els(".alram__del").forEach((button) => {
      button.addEventListener("click", (e) => {
        const parentList = e.target.closest("li");
        parentList.remove();
        console.log("hello!");
      });
    });

    // 삭제한 알람 unshift로 profile__alram반영하는 기능 추가
  };

  handleDelete();
};
