/* -------------------------------------------------------------------------- */
/*                                Chart.js 접근성                                */
/* -------------------------------------------------------------------------- */
/**
 * Chart.js 접근성 고려사항
 * 1. Canvas 기반 렌더링의 한계:
 *    - 스크린리더가 차트 데이터를 직접 읽을 수 없음
 *    - 키보드 탐색이 기본적으로 불가능
 *
 * 2. 필요한 대체 방안:
 *    - aria-label 속성 추가
 *    - 차트 데이터를 설명하는 표 제공
 *    - 차트 내용을 설명하는 텍스트 요약 추가...접근성지겹다.
 */

import { createchart } from "./02-createchart.js";
import { barChartData } from "./02-importdata.js";

createchart(".chart", barChartData);
